ASC_CalculationAlgorithms/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АгентскиеУслуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ASC_CalculationAlgorithms/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаРеализации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоИзменения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АгентскиеУслуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоИзменения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ASC_CalculationAlgorithms/CommonModules/АСЦ_ОФУ_PnL/Ext/Module.bsl
// Данная процедура вызываются из обработчика "Процедура заполнения" 
// правила обработки отчета
//
Процедура ЗаполнитьОтчет(ДокОбъект) Экспорт
	
	ДокОбъект.ОчиститьВсе();
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Дата1",        ДокОбъект.ПериодОтчета.ДатаНачала);
	Запрос.Параметры.Вставить("Дата2",        КонецДня(ДокОбъект.ПериодОтчета.ДатаОкончания));
	Запрос.Параметры.Вставить("Номенклатура", Справочники.Номенклатура.НайтиПоНаименованию("Страховки"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Выборка.Количество) КАК Количество,
	|	СУММА(Выборка.СуммаВыручка) КАК СуммаВыручка,
	|	СУММА(Выборка.СуммаАгентские) КАК СуммаАгентские,
	|	Выборка.СтатьяДоходов.Код КАК СтатьяДоходовКод,
	|	Выборка.ЦФО КАК ЦФО
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Количество,
	|		Док.Сумма КАК СуммаВыручка,
	|		0 КАК СуммаАгентские,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение КАК СтатьяДоходов,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнойЦФО КАК ЦФО
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК Док
	|	ГДЕ
	|		Док.Ссылка.Проведен
	|		И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|		И Док.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		Док.Сумма - Док.СуммаДоИзменения,
	|		0,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнойЦФО
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК Док
	|	ГДЕ
	|		Док.Ссылка.Проведен
	|		И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|		И Док.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		Док.Сумма,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнойЦФО
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК Док
	|	ГДЕ
	|		Док.Ссылка.Проведен
	|		И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|		И Док.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		Док.Сумма - Док.СуммаДоИзменения,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение,
	|		Док.Ссылка.ДоговорКонтрагента.ОсновнойЦФО
	|	ИЗ
	|		Документ.КорректировкаРеализации.АгентскиеУслуги КАК Док
	|	ГДЕ
	|		Док.Ссылка.Проведен
	|		И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|		И Док.Номенклатура В ИЕРАРХИИ(&Номенклатура)) КАК Выборка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выборка.СтатьяДоходов.Код,
	|	Выборка.ЦФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦФО
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Колонка = Выборка.СтатьяДоходовКод;
		
		ДокОбъект.УстановитьЗначениеПоказателя("Выручка" + Колонка + "_Колво", Выборка.Количество, Выборка.ЦФО);
		ДокОбъект.УстановитьЗначениеПоказателя("Выручка" + Колонка + "_Сумма", Выборка.СуммаВыручка + Выборка.СуммаАгентские, Выборка.ЦФО);
		ДокОбъект.УстановитьЗначениеПоказателя("Прибыль" + Колонка + "_Сумма", Выборка.СуммаВыручка, Выборка.ЦФО);
		
	КонецЦикла;	
	
КонецПроцедуры
